# Custom sources
tap "adembc/homebrew-tap"
tap "alexnabokikh/tfsort"
tap "aws/tap"
tap "bats-core/bats-core"
tap "busser/tap"
tap "common-fate/granted"
tap "derailed/popeye"
tap "ekristen/tap"
tap "fairwindsops/tap"
tap "hashicorp/tap"
tap "huseyinbabal/tap"
tap "iann0036/iamlive"
tap "jorgelbg/tap"
tap "kamillobinski/thock"
tap "localstack/tap"
tap "max-sixty/worktrunk"
tap "sst/tap"
tap "turbot/tap"
tap "ymtdzzz/tap"

# CLI tools
brew "act"
brew "adr-tools"
brew "ansible"
brew "ansible-lint"
brew "aqua"
brew "argo"
brew "aws-sam-cli"
brew "aws-nuke"
brew "aws-vault"
brew "awscurl"
brew "bash"
brew "bat"
brew "bats-assert"
brew "bats-core"
brew "bats-detik"
brew "bats-file"
brew "bats-support"
brew "steveyegge/beads/bd"
brew "cfn-lint"
brew "cfssl"
brew "checkov"
brew "cloud-nuke"
brew "cloudformation-guard"
brew "cmctl"
brew "colima"
brew "colordiff"
brew "commitizen"
brew "conftest"
brew "coreutils"
brew "crane"
brew "curl"
brew "deweysasser/tap/eks-kubeconfig-update"
brew "devspace"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dive"
brew "doctl"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-filter-repo"
brew "gnupg"
brew "go-task"
brew "gonzo"
brew "goreleaser"
brew "gping"
brew "granted"
brew "graphviz"
brew "gron"
brew "gum"
brew "hadolint"
brew "hashicorp/tap/vault"
brew "hcl2json"
brew "helm"
brew "hl"
brew "htop"
brew "taws"
brew "hyperfine"
brew "iamlive"
brew "ingress2gateway"
brew "iperf3"
brew "jenv"
brew "jq"
brew "k9s"
brew "keep-sorted"
brew "kingfisher"
brew "kind"
brew "kor"
brew "kube-linter"
brew "kubeconform"
brew "kubectl"
brew "kubectx"
brew "kubent"
brew "kubescape"
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "lazysql"
brew "lima"
brew "localstack-cli"
brew "ls-lint"
brew "lychee"
brew "wt"
brew "mise"
brew "mkcert"
brew "mole"
brew "mtr"
brew "mycli"
brew "nmap"
brew "nova"
brew "ollama"
brew "opencode"
brew "otel-tui"
brew "pandoc"
brew "pgcli"
brew "pinentry"
brew "pinentry-mac"
brew "pinentry-touchid"
brew "pluto"
brew "polaris"
brew "popeye"
brew "powerpipe"
brew "pre-commit"
brew "prek"
brew "procs"
brew "qwen-code"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "showkey"
brew "semgrep"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "snitch"
brew "sops"
brew "sslscan"
brew "starship"
brew "steampipe"
brew "tailpipe"
brew "tcpdump"
brew "television"
brew "tenv"
brew "terraform-docs"
brew "tfautomv"
brew "tfk8s"
brew "tflint"
brew "tfsort"
brew "thefuck"
brew "thock"
brew "tldr"
brew "tree"
brew "trivy"
brew "trufflehog"
brew "uv"
brew "vim"
brew "virtctl"
brew "wasm-pack"
brew "watch"
brew "wget"
brew "yq"
brew "zizmor"
brew "zoxide"

# GUI tools
cask "1password"
cask "1password-cli"
cask "arc"
# cask "battery"
cask "chatgpt"
cask "claude"
cask "dbeaver-community"
cask "drawio"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "iterm2"
cask "maccy"
cask "obsidian"
cask "openlens"
cask "raycast"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
cask "zen"
