# Custom sources
tap "bats-core/bats-core"
tap "hashicorp/tap"
tap "huseyinbabal/tap"
tap "jorgelbg/tap"
tap "turbot/tap"
tap "ymtdzzz/tap"

# CLI tools
brew "act"
brew "adr-tools"
brew "ansible"
brew "ansible-lint"
brew "agent-browser"
brew "aqua"
brew "argo"
brew "argocd"
brew "aws-sam-cli"
brew "aws-nuke"
brew "aws-vault"
brew "awscurl"
brew "bash"
brew "bat"
brew "bats-core"
brew "bats-core/bats-core/bats-assert"
brew "bats-core/bats-core/bats-detik"
brew "bats-core/bats-core/bats-file"
brew "bats-core/bats-core/bats-support"
brew "beads"
brew "cfn-lint"
brew "cfssl"
brew "checkov"
brew "cloud-nuke"
brew "cloudformation-guard"
brew "cmctl"
brew "colordiff"
brew "commitizen"
brew "conftest"
brew "coreutils"
brew "crane"
brew "curl"
brew "deweysasser/tap/eks-kubeconfig-update"
brew "devspace"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dive"
brew "doctl"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-filter-repo"
brew "gnupg"
brew "go-task"
brew "gonzo"
brew "goreleaser"
brew "gping"
brew "granted"
brew "graphviz"
brew "gron"
brew "gum"
brew "hadolint"
brew "hashicorp/tap/vault"
brew "hcl2json"
brew "helm"
brew "hl"
brew "htop"
brew "huseyinbabal/tap/taws"
brew "hyperfine"
brew "iann0036/iamlive/iamlive"
brew "ingress2gateway"
brew "iperf3"
brew "jenv"
brew "jq"
brew "k9s"
brew "keep-sorted"
brew "kingfisher"
brew "kind"
brew "kor"
brew "kube-linter"
brew "kubeconform"
brew "kubectl"
brew "kubectx"
brew "kubent"
brew "kubescape"
brew "lance0/tap/ttl"
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "lazysql"
brew "localstack"
brew "ls-lint"
brew "lychee"
brew "mise"
brew "mkcert"
brew "mole" if OS.mac?
brew "mtr"
brew "mycli"
brew "nmap"
brew "ollama"
brew "opencode"
brew "ymtdzzz/tap/otel-tui"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "pgcli"
brew "pinentry"
brew "pluto"
brew "polaris"
brew "popeye"
brew "powerpipe"
brew "pre-commit"
brew "prek"
brew "procs"
brew "qwen-code"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "rtk"
brew "ruff"
brew "s5cmd"
brew "showkey"
brew "semgrep"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "snitch"
brew "sops"
brew "sslscan"
brew "starship"
brew "steampipe"
brew "sysdig"
brew "tabiew"
brew "talosctl"
brew "tailpipe"
brew "tailscale"
brew "tcpdump"
brew "television"
brew "tenv"
brew "terraform-docs"
brew "tfautomv"
brew "tfk8s"
brew "tflint"
brew "tfsort"
brew "thefuck"
brew "tldr"
brew "tree"
brew "trivy"
brew "trufflehog"
brew "uv"
brew "vim"
brew "virtctl"
brew "wasm-pack"
brew "watch"
brew "wget"
brew "worktrunk"
brew "yq"
brew "zizmor"
brew "zoxide"

# macOS-only CLI tools
brew "colima" if OS.mac?
brew "lima" if OS.mac?
brew "mole" if OS.mac?
brew "pinentry-mac" if OS.mac?
brew "jorgelbg/tap/pinentry-touchid" if OS.mac?

# Linux-only CLI tools
brew "strace" if OS.linux?


# GUI tools (macOS only)
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "arc" if OS.mac?
# cask "battery" if OS.mac?
cask "chatgpt" if OS.mac?
cask "claude-code" if OS.mac?
cask "codex" if OS.mac?
cask "dbeaver-community" if OS.mac?
cask "drawio" if OS.mac?
cask "firefox" if OS.mac?
cask "font-meslo-lg-nerd-font" if OS.mac?
cask "gcloud-cli" if OS.mac?
cask "ghostty" if OS.mac?
cask "iterm2" if OS.mac?
cask "jmreicha/tap/cfgctl" if OS.mac?
cask "kamillobinski/thock/thock" if OS.mac?
cask "maccy" if OS.mac?
cask "nova" if OS.mac?
cask "obsidian" if OS.mac?
cask "openlens" if OS.mac?
cask "raycast" if OS.mac?
cask "session-manager-plugin" if OS.mac?
cask "slack" if OS.mac?
cask "stats" if OS.mac?
cask "stratoshark" if OS.mac?
cask "steipete/tap/codexbar" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "wezterm" if OS.mac?
cask "zed" if OS.mac?
cask "zen" if OS.mac?
