# Custom sources
tap "adembc/tap", trusted: true
tap "alexnabokikh/tfsort", trusted: true
tap "anomalyco/tap", trusted: true
tap "aquaproj/aqua", trusted: true
tap "aws/tap", trusted: true
tap "bats-core/bats-core", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "busser/tap", trusted: true
tap "common-fate/granted", trusted: true
tap "datadog-labs/pack", trusted: true
tap "derailed/popeye", trusted: true
tap "deskflow/tap", trusted: true
tap "ekristen/tap", trusted: true
tap "fairwindsops/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "huseyinbabal/tap", trusted: true
tap "jesseduffield/lazydocker", trusted: true
tap "jesseduffield/lazygit", trusted: true
tap "jorgelbg/tap", trusted: true
tap "manaflow-ai/cmux", trusted: true
tap "max-sixty/worktrunk", trusted: true
tap "mhaeuser/mhaeuser", trusted: true
tap "rhysmcneill/ssmctl", trusted: true
tap "steveyegge/beads", trusted: true
tap "turbot/tap", trusted: true
tap "ymtdzzz/tap", trusted: true

# CLI tools
brew "act"
brew "actionlint"
brew "action-validator"
brew "adr-tools"
brew "ansible"
brew "ansible-lint"
brew "agent-browser"
brew "aqua"
brew "argo"
brew "argocd"
brew "ast-grep"
brew "aws-sam-cli"
brew "aws-nuke"
brew "aws-vault"
brew "awscurl"
brew "bash"
brew "bat"
brew "bats-core"
brew "bats-core/bats-core/bats-assert", trusted: true
brew "bats-core/bats-core/bats-detik", trusted: true
brew "bats-core/bats-core/bats-file", trusted: true
brew "bats-core/bats-core/bats-support", trusted: true
brew "beads"
brew "boring"
brew "cfn-lint"
brew "cfssl"
brew "checkov"
brew "cloud-nuke"
brew "cloudformation-guard"
brew "cmctl"
brew "colordiff"
brew "commitizen"
brew "conftest"
brew "coreutils"
brew "crane"
brew "curl"
brew "deweysasser/tap/eks-kubeconfig-update", trusted: true
brew "devspace"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dive"
brew "doctl"
brew "dolt"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-filter-repo"
brew "gnupg"
brew "go-task"
brew "gonzo"
brew "goreleaser"
brew "gping"
brew "granted"
brew "graphviz"
brew "gron"
brew "gum"
brew "hadolint"
brew "hashicorp/tap/vault", trusted: true
brew "hcl2json"
brew "helm"
brew "hl"
brew "htop"
brew "huseyinbabal/tap/taws", trusted: true
brew "hyperfine"
brew "iann0036/iamlive/iamlive", trusted: true
brew "ingress2gateway"
brew "iperf3"
brew "jenv"
brew "jmreicha/tap/cfgctl", trusted: true
brew "jq"
brew "k9s"
brew "keep-sorted"
brew "kingfisher"
brew "kind"
brew "kor"
brew "krew"
brew "kube-linter"
brew "kubeconform"
brew "kubectl"
brew "kubectx"
brew "kubent"
brew "kubescape"
brew "lance0/tap/ttl", trusted: true
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "lazysql"
brew "llmfit"
brew "localstack/tap/localstack-cli", trusted: true
brew "ls-lint"
brew "lychee"
brew "matthart1983/tap/netwatch", trusted: true
brew "mise"
brew "mkcert"
brew "mq"
brew "mtr"
brew "mycli"
brew "nmap"
brew "ollama"
brew "opencode"
brew "oven-sh/bun/bun", trusted: true
brew "pandoc"
brew "pgcli"
brew "pinentry"
brew "pluto"
brew "polaris"
brew "popeye"
brew "powerpipe"
brew "pre-commit"
brew "prek"
brew "procs"
brew "datadog-labs/pack/pup", trusted: true
brew "rclone"
brew "resterm"
brew "ripgrep"
brew "rsync"
brew "rtk"
brew "ruff"
brew "s5cmd"
brew "showkey"
brew "semgrep"
brew "sevenzip"
brew "sheeki03/tap/tirith", trusted: true
brew "shellcheck"
brew "shfmt"
brew "snitch"
brew "sops"
brew "ssmctl"
brew "sslscan"
brew "starship"
brew "steampipe"
brew "sysdig"
brew "tabiew"
brew "talosctl"
brew "tailpipe"
brew "tailscale"
brew "tcpdump"
brew "television"
brew "temporal"
brew "tenv"
brew "terraform-docs"
brew "tfautomv"
brew "tfk8s"
brew "tflint"
brew "tfsort"
brew "thefuck"
brew "tldr"
brew "tree"
brew "trivy"
brew "trufflehog"
brew "ty"
brew "uv"
brew "vim"
brew "virtctl"
brew "wasm-pack"
brew "watch"
brew "wget"
brew "worktrunk"
brew "yq"
brew "zizmor"
brew "zoxide"

# Kubectl plugins
krew "ctx"
krew "ktop"
krew "neat"
krew "ns"
krew "sniff"
krew "tail"
krew "tree"
krew "radar"

# OSX CLI tools
brew "colima" if OS.mac?
brew "lima" if OS.mac?
brew "mole" if OS.mac?
brew "pinentry-mac" if OS.mac?
brew "jorgelbg/tap/pinentry-touchid", trusted: true if OS.mac?

# Linux CLI tools
brew "strace" if OS.linux?

# GUI tools
cask "devtunnel"

# OSX GUI tools
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "arc" if OS.mac?
# cask "battery" if OS.mac?
cask "chatgpt" if OS.mac?
cask "claude-code" if OS.mac?
cask "cmux" if OS.mac?
cask "codex" if OS.mac?
cask "common-repo/tap/common-repo", trusted: true if OS.mac?
cask "dbeaver-community" if OS.mac?
cask "drawio" if OS.mac?
cask "firefox" if OS.mac?
cask "font-meslo-lg-nerd-font" if OS.mac?
cask "gcloud-cli" if OS.mac?
cask "ghostty" if OS.mac?
cask "iterm2" if OS.mac?
cask "kamillobinski/thock/thock", trusted: true if OS.mac?
cask "maccy" if OS.mac?
cask "nova" if OS.mac?
cask "obsidian" if OS.mac?
cask "openlens" if OS.mac?
cask "raycast" if OS.mac?
cask "session-manager-plugin" if OS.mac?
cask "slack" if OS.mac?
cask "stats" if OS.mac?
cask "stratoshark" if OS.mac?
cask "steipete/tap/codexbar", trusted: true if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "wezterm" if OS.mac?
cask "zed" if OS.mac?
cask "zen" if OS.mac?
